CORPO_ALLUNGATO/Attuato/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          222;
        startFace       41052;
    }
    outlet
    {
        type            patch;
        nFaces          106;
        startFace       41274;
    }
    topWall
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          104;
        startFace       41380;
    }
    bottomWall
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          104;
        startFace       41484;
    }
    bodyWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          348;
        startFace       41588;
    }
    actuatorSlot_top
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       41936;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          41504;
        startFace       41946;
    }
    actuatorSlot_bottom
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       83450;
    }
)

// ************************************************************************* //
